In [2]:
import pandas as pd
import numpy as np

In [14]:
col = ['Price','Rooms','location']

In [21]:
#Reading the Rent Data
Data = pd.read_csv('/Users/Vishal/Documents/scrapping_new.csv',names=col,header = None,sep = ',')

In [135]:
pd.options.display.max_rows = 1000

In [53]:
#Data tyoe conversion
Data['location'] = Data['location'].apply(lambda x : str(x))
Data['Rooms'] = Data['Rooms'].apply(lambda x : str(x))

In [ ]:
#Creating a new column called Districts with all the District Values
Data['Districts'] = Data['location'].apply(lambda x : x[-10:])

In [37]:
Data.head()

,Price,Rooms,location,Districts
0,"€2,000 monthly","3 bedrooms (1 single, 2 double), 2 bathrooms, ...","Homeville Court, Knocklyon, Dublin 16",Dublin 16
1,"€1,272 monthly","1 bedroom (1 double), 1 bathroom, furnished","Beech House, Carrickmines Green, Carrickmines,...",Dublin 18
2,"€1,600 monthly","1 bedroom (1 double), 1 bathroom, furnished","Rockview, Sandyford, Dublin 18",Dublin 18
3,"€1,725 monthly","3 bedrooms (3 double), 2 bathrooms, furnished","Old River Road, Blanchardstown, Dublin 15",Dublin 15
4,"€1,700 monthly","2 bedrooms (2 double), 1 bathroom, furnished","Hybreasal House, Kilmainham, Dublin 8",", Dublin 8"

In [130]:
#Creating a new column called Bedroom_single with necessary conditions( one single bedroom = 1, Two single Bedroom = 2 etc)
Data['Bedroom_Single'] = np.where(Data['Rooms'].str.contains('1 single'), 1,
                                  (np.where(Data['Rooms'].str.contains('2 single'), 2,
                                            np.where(Data['Rooms'].str.contains('3 single'), 3, 0))))

In [140]:
#Creating a new column called Bedroom_Double with necessary conditions( one Double bedroom = 1, Two Double Bedroom = 2 etc)

Data['Bedroom_Double'] = np.where(Data['Rooms'].str.contains('1 double'), 1,
                                  (np.where(Data['Rooms'].str.contains('2 double'), 2,
                                            np.where(Data['Rooms'].str.contains('3 double'), 3, 0))))

In [138]:
#Creating a new column called No_of_Bathrooms

Data['No_of_Bathrooms'] = np.where(Data['Rooms'].str.contains('1 bathroom'), 1,
                                  (np.where(Data['Rooms'].str.contains('2 bathrooms'), 2,
                                            np.where(Data['Rooms'].str.contains('3 bathrooms'), 3, 0))))

In [144]:
#Creating a new column called studio_apartment
Data['studio_apartment'] = np.where(Data['Rooms'].str.contains('studio'), 1,0)

In [167]:
Data.head()

,Price,Rooms,location,Districts,Bedroom_Double,Bedroom_Single,No_Of_Bathrooms,Studio_Apartment
0,"€2,000 monthly","3 bedrooms (1 single, 2 double), 2 bathrooms, ...","Homeville Court, Knocklyon, Dublin 16",Dublin 16,2,1,2,0
1,"€1,272 monthly","1 bedroom (1 double), 1 bathroom, furnished","Beech House, Carrickmines Green, Carrickmines,...",Dublin 18,1,0,1,0
2,"€1,600 monthly","1 bedroom (1 double), 1 bathroom, furnished","Rockview, Sandyford, Dublin 18",Dublin 18,1,0,1,0
3,"€1,725 monthly","3 bedrooms (3 double), 2 bathrooms, furnished","Old River Road, Blanchardstown, Dublin 15",Dublin 15,3,0,2,0
4,"€1,700 monthly","2 bedrooms (2 double), 1 bathroom, furnished","Hybreasal House, Kilmainham, Dublin 8",Dublin 8,2,0,1,0

In [155]:
#Cleaning the data in the column
Data['Districts'] = Data['Districts'].apply(lambda x : re.sub(r"[^a-zA-Z0-9]+", ' ',x))

In [168]:
#Removing the Euro symbol
Data['Price'] = Data['Price'].apply(lambda x : re.sub(r"[^0-9]+", '',x))

In [178]:
Data['Price'] = Data['Price'].apply(lambda x : int(x))
Data.head()

,Price,Rooms,location,Districts,Bedroom_Double,Bedroom_Single,No_Of_Bathrooms,Studio_Apartment
0,2000,"3 bedrooms (1 single, 2 double), 2 bathrooms, ...","Homeville Court, Knocklyon, Dublin 16",Dublin 16,2,1,2,0
1,1272,"1 bedroom (1 double), 1 bathroom, furnished","Beech House, Carrickmines Green, Carrickmines,...",Dublin 18,1,0,1,0
2,1600,"1 bedroom (1 double), 1 bathroom, furnished","Rockview, Sandyford, Dublin 18",Dublin 18,1,0,1,0
3,1725,"3 bedrooms (3 double), 2 bathrooms, furnished","Old River Road, Blanchardstown, Dublin 15",Dublin 15,3,0,2,0
4,1700,"2 bedrooms (2 double), 1 bathroom, furnished","Hybreasal House, Kilmainham, Dublin 8",Dublin 8,2,0,1,0